#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
Розробити функцію find_fraction(summ), 
 яка приймає 1 аргумент -- невід'ємне ціле число summ, 
 та повертає тьюпл, що містить 2 цілих числа -- чисельник та знаменник 
 найбільшого правильного нескорочуваного дробу, для якого сума чисельника та знаменника 
 дорівнює summ. Повернути False, якщо утворити такий дріб неможливо.

Тести із некоректними даними не проводяться.

Приклад послідовності дій для тестування:
 print find_fraction(2) # False
 print find_fraction(3) # (1, 2)
 print find_fraction(10) # (3, 7)
 print find_fraction(62) # (29, 33)
 print find_fraction(150000001) # (75000000, 75000001)
-------------------------------
1) Ділимо суму навпіл (півсума)
2) Якщо сума кратна 2, то:
      1) Якщо півсума кратна 2, то повертаємо півсуму -/+ 1
      2) Інакше повертаємо півсуму -/+ 2
3) Інакше повертаємо півсуму -/+ 0.5

 Під поверненням півсуми -/+ значення, слід розуміти
результуючий тьюпл, який склідається з двох елементів:
1) півсума - значення
2) півсума + значення

"""
def find_fraction(summ):
	
