#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
Розробити функцію bouquets(narcissus_price, tulip_price, rose_price, summ), 
 яка приймає 4 аргументи -- додатні дійсні числа 
 (ціни за один нарцис, тюльпан та троянду, і суму грошей у кишені головного героя), 
 та повертає ціле число -- кількість варіантів букетів, які можна скласти з цих видів квітів, 
 таких щоб вартість кожного букету не перевищувала summ.

Не забути, що букети з парною (загальною) кількістю квітів живим дівчатам не дарують. 
Тести із некоректними даними не проводяться.

Приклад послідовності дій для тестування:
 print bouquets(1,1,1,5) # 34
 print bouquets(2,3,4,10) # 12
 print bouquets(2,3,4,100) # 4019
 print bouquets(200,300,400,10000) # 4019
 print bouquets(200,300,400,100000) # 3524556
"""
def bouquets(narcissus_price, tulip_price, rose_price, summ):
	
	
