#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
Розробити функцію make_sudoku(size), 
 яка приймає 1 аргумент -- додатнє ціле число (1 <= size <= 42), 
 та повертає список списків -- квадратну матрицю, що представляє судоку розмірності size.

Судоку розмірності X являє собою квадратну матрицю розмірністю X**2 на X**2, 
розбиту на X**2 квадратів розмірністю X на X, заповнену цілими числами таким чином, 
щоб кожна вертикаль, кожна горизонталь та кожний квадрат містили всі числа від 1 до X**2 
включно без повторів.

Наприклад, судоку розмірності 3 може виглядати наступним чином:
"""
def make_sudoku(size):

