#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Вхідні дані: довільна, відмінна від нуля, кількість значень - аргументів командного рядка. Значеннями-аргументами можуть бути числа або рядки, які складаються з цифр та літер латинського алфавіту без пробілів.

Результат роботи: рядок, що складається з отриманих значень в зворотньому порядку, записаних через пробіл.

Наприклад
 Вхідні дані: 1
 Результат: 1
 Вхідні дані: qwe asd zxc 123
 Результат: 123 zxc asd qwe
 Вхідні дані: padawan young my HAVE MUST YOU PATIENCE
 Результат: PATIENCE YOU MUST HAVE my young padawan
 """
