#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Вхідні дані: рядок, передається в програму як аргумент командного рядка. Може містити пробіли, літери латинського алфавіту в будь-якому регістрі та цифри. Для передачі одним значенням рядок, що містить пробіли, береться в подвійні лапки.

Результат роботи: рядок "YES", якщо отриманий рядок є паліндромом, або "NO" - якщо ні. Рядок вважається паліндромом, якщо він однаково читається як зліва направо, так і зправа наліво. Відмінністю регістрів та пробілами знехтувати.

Наприклад
 Вхідні дані: 0
 Результат: YES
 Вхідні дані: puppy
 Результат: NO
 Вхідні дані: "mystring1Gni rts ym"
 Результат: YES
 """
