#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Вхідні дані: довільна, відмінна від нуля, кількість значень - аргументів командного рядка. 
Значеннями-аргументами можуть бути числа або рядки, 
які складаються з цифр та літер латинського алфавіту без пробілів.

Результат роботи: рядок, що складається з отриманих значень в зворотньому порядку, 
записаних через пробіл.

Наприклад
 Вхідні дані: 1
 Результат: 1
 Вхідні дані: qwe asd zxc 123
 Результат: 123 zxc asd qwe
 Вхідні дані: padawan young my HAVE MUST YOU PATIENCE
 Результат: PATIENCE YOU MUST HAVE my young padawan
 """
import sys
s=sys.argv[1];s=list(s)
s2=''
z=0
l=[]
print s
for i in s:
	s2=s2+i
print s2
#~ while z < len(s):
	#~ s2=s2+' '+s[-1-z]
	#~ z+=1 
#~ s2=s2.strip(); print s2
